src/cf/Documents/ПроизводственнаяОперацияВЕТИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ПроизводственнаяОперацияВЕТИС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЗаписиСкладскогоЖурналаВРезервеВЕТИС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПроизводственнаяОперацияВЕТИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйствующийСубъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозяйствующиеСубъектыВЕТИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПредприятияВЕТИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТорговыйОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТорговыйОбъектВЕТИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПроизводственнойТранзакции</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИдентификаторПроизводственнойТранзакцииВЕТИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗавершениеПроизводственнойТранзакции</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продукция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПродукцияВЕТИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Номенклатура</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ХарактеристикаНоменклатуры</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СерияНоменклатурыВЕТИС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоВЕТИС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоВЕТИС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмеренияВЕТИС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмеренияВЕТИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПроизводстваСтрока</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СтрокаВЕТИС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПроизводстваТочностьЗаполнения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТочностьЗаполненияПериодаВЕТИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПроизводстваНачалоПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПроизводстваКонецПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокГодностиСтрока</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СтрокаВЕТИС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокГодностиТочностьЗаполнения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТочностьЗаполненияПериодаВЕТИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокГодностиНачалоПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокГодностиКонецПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СкоропортящаясяПродукция</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НизкокачественнаяПродукция</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭкспертизаВыполнена</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭкспертизаРезультат</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РезультатыЛабораторныхИсследованийВЕТИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсобыеОтметки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СтрокаВЕТИС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаписьСкладскогоЖурнала</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗаписиСкладскогоЖурналаВЕТИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВетеринарноСопроводительныйДокумент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВетеринарноСопроводительныйДокументВЕТИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусУказанияСерий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторПартии</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СтрокаВЕТИС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Сырье</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продукция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПродукцияВЕТИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Номенклатура</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ХарактеристикаНоменклатуры</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СерияНоменклатурыВЕТИС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоВЕТИС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоВЕТИС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмеренияВЕТИС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмеренияВЕТИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаписьСкладскогоЖурнала</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗаписиСкладскогоЖурналаВЕТИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаписьСкладскогоЖурналаАрхив</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗаписиСкладскогоЖурналаВЕТИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусУказанияСерий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УпаковкиВЕТИС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиТовары</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УровеньУпаковки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.УровниУпаковокВЕТИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УпаковкаВЕТИС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиВЕТИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковокВЕТИС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ШтрихкодыУпаковок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Штрихкод</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СтрокаВЕТИС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипМаркировки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыМаркировкиУпаковокВЕТИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШтрихкодУпаковки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШтрихкодыУпаковокТоваров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТехнологическийПроцесс</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипОперации</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыПроизводственныхОперацийВЕТИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОперацииНачалоПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОперацииКонецПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Catalogs/ИдентификаторыПроизводственныхТранзакцийБПВЕТИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ИдентификаторыПроизводственныхТранзакцийБПВЕТИС</Name>
			<Comment>Служебный</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаТранзакции</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйствующийСубъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозяйствующиеСубъектыВЕТИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПредприятияВЕТИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/СобытияФормВЕТИСБПКлиент/Ext/Module.bsl
#Область СобытияФормВЕТИС

//Началовыбора транзакции
//Параметры:
//			Форма Тип("Форма")
//			Элемент Тип("ЭлементФормы")
//			ПараметрыОтбора Тип("Структура")
//			СтрандартнаяОбработка Тип("Булево")
//
//Возвращаемое значение: Нет
//
Процедура ВыбратьТразакцию_НачалоВыбора(Форма, Элемент, ПараметрыОтбора, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка 	= Ложь;
	ПараметрыФормы 			= Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора"		  , Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе"  , Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор"  , Ложь);
	ПараметрыФормы.Вставить("ДокументОснование"   , Форма.Объект.ДокументОснование);
	ПараметрыФормы.Вставить("ХозяйствующийСубъект", Форма.Объект.ХозяйствующийСубъект);
	ПараметрыФормы.Вставить("Предприятие"         , Форма.Объект.Предприятие);
	ОткрытьФорму("Справочник.ИдентификаторыПроизводственныхТранзакцийБПВЕТИС.Форма.ФормаВыбора", ПараметрыФормы, Элемент);
	
КонецПроцедуры

//Обработка выбора
//Параметры:
//			Форма Тип("Форма")
//			Элемент Тип("ЭлементФормы")
//			ВыбранноеЗначение Тип("Любой")
//			СтрандартнаяОбработка Тип("Булево")
//
//Возвращаемое значение: Нет
//
Процедура ПриВыбореДействия_ОбработкаВыбора(Форма, Элемент, ВыбранноеЗначение, СтандартнаяОбработка) Экспорт
	
	УстановитьВидимостьФлагаЗавершенияТранзакции(Форма);
	УстановитьФлагЗавершенияТранзакции(Форма.Объект);
	
КонецПроцедуры

//Обработчик ПриСоздании новогоэлемента
//Параметры: 
//			Форма Тип("Форма")
//			Элемент Тип("ЭлементФормы")
//			СтандартнаяОбработка Тип("Булево")
//
//Возвращаемое значение: нет
//
Процедура ПроизводственнаяТранзакция_ПриСоздании(Форма, Элемент, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка 	= Ложь;
	ПараметрыФормы 			= Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыФормы.Вставить("Основание", Форма.Объект);
	ОткрытьФорму("Справочник.ИдентификаторыПроизводственныхТранзакцийБПВЕТИС.Форма.ФормаЭлемента", ПараметрыФормы, Элемент);
	
КонецПроцедуры

//Устанавливает видимость флага завершения транзакции
//Параметры: Форма Тип("Форма")
//
//Возвращаемое значение: нет
//
Процедура УстановитьВидимостьФлагаЗавершенияТранзакции(Форма)
	
	Форма.Элементы.ЗавершениеПроизводственнойТранзакции.Видимость = 
		ИнтеграцияВЕТИСБПВызовСервера.ПолучитьВидимостьЭлементаЗавершенияПроизводственнойТранзакцииПоОснованию(
			Форма.Объект.ДокументОснование);
	
КонецПроцедуры

//Устанавливает флаг завршения производственной транзакции
//Параметры Объект Тип("ОбъектФормы")
//
//Возвращаемое значение: нет
//
Процедура УстановитьФлагЗавершенияТранзакции(Объект) Экспорт
	
	Если ИнтеграцияВЕТИСБПВызовСервера.ЭтоВыпускПродукции(Объект.ДокументОснование) Тогда
		Объект.ЗавершениеПроизводственнойТранзакции = Истина;
	ИначеЕсли ИнтеграцияВЕТИСБПВызовСервера.ЭтоОтчетПроизводстваЗаСмену(Объект.ДокументОснование) Тогда
		Транзакция = ИнтеграцияВЕТИСБПВызовСервера.НайтиТранзакцию(Объект.ДокументОснование);
		Если ЗначениеЗаполнено(Транзакция) Тогда
			Объект.ЗавершениеПроизводственнойТранзакции = Истина;
		Иначе
			Объект.ЗавершениеПроизводственнойТранзакции = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

//Открывает форму нового документа
//Параметры: ОснованиеСсылка 
//							Тип("ДокуметСсылка.ТребованиеНакладная")
//							Тип("ДокументСсылка.ОтчетПроизводстваЗаСмену")
//
//Возвращаемое значение: нет
//
Процедура ОткрытьФормуДокументаПроизводственнойОперацииВЕТИС(ОснованиеСсылка) Экспорт
	
	ДокСсылка = ИнтеграцияВЕТИСБПВызовСервера.НайтиСсылкуПроизводственнойОперациВЕТИС(ОснованиеСсылка);
	Если ЗначениеЗаполнено(ДокСсылка) Тогда
		ПараметрыФормы = Новый Структура("Ключ",ДокСсылка);
		ОткрытьФорму("Документ.ПроизводственнаяОперацияВЕТИС.Форма.ФормаДокумента",ПараметрыФормы);
	Иначе
		ДополнительныеПараметры = Новый Структура("Основание", ОснованиеСсылка);
		ОткрытьФорму("Документ.ПроизводственнаяОперацияВЕТИС.ФормаОбъекта", ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
